#+TITLE: Python for early children

#+REVEAL_ROOT: https://cdn.jsdelivr.net/npm/reveal.js@3.9.0

#+REVEAL_EXTERNAL_PLUGIN: ( chalkboard menu )
# #+REVEAL_EXTRA_CSS: ./mystyle.css
#+ATTR_ORG: :width 200/250/300/400/500/600
#+ATTR_LATEX: :width 2.0in
#+ATTR_HTML: :width 200/250/300/400/500/600px
#+REVEAL_TITLE_SLIDE: <h2>%t</h2><h3>%s</h3><p>%A %a</p><p><a href="%u">%u</a></p>
#+REVEAL_THEME: moon
# ./assets/stars.jpg
#+REVEAL_TITLE_SLIDE_BACKGROUND: https://images.freeimages.com/images/large-previews/f0d/night-sky-1401615.jpg
#+Subtitle: Getting started
#+Author: laurent
#+Email: laurent_pinson@hotmail.com
#+REVEAL_TALK_URL: https://laurenthyz.github.io/rachel/index.html


# * Lesson 1
# ,/Pictures/
# Welcome to Python 101, and congratulations on learning coding that early in life!
# #+BEGIN_EXPORT html
# <iframe src="https://giphy.com/embed/11ISwbgCxEzMyY" width="480" height="360" frameBorder="0" class="giphy-embed" allowFullScreen></iframe>
# #+END_EXPORT


# ** White-board 白板区

# #+BEGIN_EXPORT html
# <iframe width="100%" height="500px" src="https://awwapp.com/b/u4r84anbireo8/" allowfullscreen></iframe>
# #+END_EXPORT


# ** Reading area
# When we talk about coding we use specific terms (function, data types, boolean, integers etc...).
# It is important that you pronounce those words properly (你的发音提高的话你的听力也会提高，而上课的时候听力至关重要), so visit this reading area as often as you can!
# #+BEGIN_EXPORT html
# <div class="iframe-container">
# <iframe src="https://giphy.com/embed/2S4djnTiypJZK" frameBorder="0" class="giphy-embed" allowFullScreen></iframe>
# </div>
# #+END_EXPORT


#  #+REVEAL: split
# Coding with Python is just like learning english, pronunciation is crucially important!

# #+BEGIN_EXPORT html

# <!DOCTYPE html>
#   <head>

#     <script nonce="rjCTJjuEvbJBL74rVobCrA">
# (function(e, p){
#     var m = location.href.match(/platform=(win8|win|mac|linux|cros)/);
#     e.id = (m && m[1]) ||
*** games
Pick the code you like most :)
#+BEGIN_SRC
matoom.points = 0
print(matoom.points)
for step in range(3):
    matoom.run_lap()
    matoom.burpee()
    matoom.points += 1

matoom.points = 0
print(matoom.points)
for step in range(3):
    matoom.run_lap()
    matoom.burpee()
    matoom.points += 1

#+END_SRC

#+BEGIN_SRC
jasmine.points =
print(matoom.points)
for step in range(4):
    jasmine.run_lap()
    jasmine.burpee()
    jasmine.points += 1

jasmine.points = 0
print(matoom.points)
for step in range(3):
    matoom.run_lap()
    matoom.burpee()
    matoom.points += 1

#+END_SRC
#+BEGIN_SRC python
for item in  fp
#+END_SRC

#+BEGIN_SRC python :results output
from time import sleep
for step in range(4):
    print(step)
    sleep(1)

#+END_SRC

#+RESULTS:
: 0
: 1
: 2
: 3
